leetcode_891_sum_of_subsequence_widths.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 891. Sum of Subsequence Widths</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 891. Sum of Subsequence Widths</h1>
<ul class="org-ul">
<li><a href="pattern_compute_value_for_all_subsequences_of_an_array.html#ID-21114DEC-E1B0-4B45-8A7C-E4DA93BB9474">Pattern: Compute value for all subsequences of an array</a>.  Sort the array and compute how many time each element appear as the minimum and maximum in all subsequences.  Time complexity is \(O(n)\) with space \(O(1)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sumSubseqWidths</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(nums)
        <span style="font-weight: bold; font-style: italic;">MOD</span> = 10**9 + 7
        nums.sort()

        <span style="font-weight: bold; font-style: italic;">mins</span> = 0
        <span style="font-weight: bold; font-style: italic;">maxs</span> = 0
        <span style="font-weight: bold; font-style: italic;">p</span> = 1
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold; font-style: italic;">mins</span> = (mins + nums[N - i - 1] * p) % MOD
            <span style="font-weight: bold; font-style: italic;">maxs</span> = (maxs + nums[i] * p) % MOD
            <span style="font-weight: bold; font-style: italic;">p</span> = (p * 2) % MOD

        <span style="font-weight: bold;">return</span> (maxs - mins + MOD) % MOD
</pre>
</div>
</div>
</body>
</html>